app/controllers/auctions_controller.rb

  def index
    @user = User.find_by_id(session[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def show
    @user = User.find_by_id(session[:user_id])
    @auction = Auction.find(params[:id])
    @seller = User.find_by_username(@auction.user_name)
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
SELECT * FROM "auctions" WHERE ("auctions"."id" = 0)
SELECT * FROM "users" WHERE ("users"."username" = 'lucazoia') LIMIT 1

  def new
    if is_login
      @user = User.find_by_id(session[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1

  def create
    if is_login
      @auction = Auction.new(params[:auction])
      @user = User.find_by_id(session[:user_id])
      @auction.user_name = @user.username
      @auction.visible = true
      @auction.status = true

      respond_to do |format|
        if @auction.save
---
SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
INSERT INTO "auctions" ("created_at", "category", "image_url", "current_price", "updated_at", "start_price", "user_name", "description", "auction_name", "expire", "status", "visible") VALUES('2010-11-30 17:24:37', 'Clothing, Shoes & Jewelry->Clothing', 'http://www.icelandicsheep.com/Made-with-TRF-wool-photos/sweater.jpg', 50.0, '2010-11-30 17:24:37', 20.0, 'skunlong', 'sweater', 'sweater', '2010-11-30 17:21:00', 't', 't')