app/controllers/bids_controller.rb

  def create
    if is_login
      @bid = Bid.new(params[:bid])
      if@bid.auction_id != nil
        @bid.user_id = session[:user_id]
        @auction = Auction.find_by_id(@bid.auction_id)
---
SELECT * FROM "auctions" WHERE ("auctions"."id" = 5) LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1