app/controllers/main_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def welcome
    @page_title = "Welcome to phoneix auction website"
    @user = nil
    if(session[:user_id] != nil)
      @user = User.find_by_id(session[:user_id])