app/controllers/messages_controller.rb

INSERT INTO "messages" ("created_at", "title", "updated_at", "send_time", "from_id", "read_status", "content", "to_id") VALUES('2010-11-20 21:26:43', 'abc', '2010-11-20 21:26:43', '2010-11-20 21:26:43', 2, 'f', 'abc', 1)
---
  def create
    if is_login
      @user = User.find_by_sql "SELECT * FROM users WHERE username = '#{params[:message][:receiver_name]}'"
      if @user == nil || @user.length == 0
        flash[:notice] = "Cannot find the receiver"
        @message = {
                     :receiver_name => params[:message][:receiver_name],
                     :title => params[:message][:title],
                     :content => params[:message][:content]
                   }
        @user = User.find_by_id(session[:user_id])
        render :action => "new"
      else
        @user = @user[0]
        @message = Message.new
        @message.from_id = session[:user_id]
        @message.to_id = @user.id
        @message.title = params[:message][:title]
        @message.content = params[:message][:content]
        @message.send_time = Time.now
        @message.read_status = false
        @user = User.find_by_id(session[:user_id])
        if @message.save

SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
---
  def index
    if is_login
      @messages = Message.find_message_and_user_name_by_id session[:user_id]
      @user = User.find_by_id(session[:user_id])

SELECT * FROM "messages" WHERE ("messages"."id" IS NULL) LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
---
  def show
      if is_login
        @message = Message.find_by_id(params[:id])
        @receiver = User.find_by_id(session[:user_id])

SELECT * FROM "users" WHERE ("users"."id" = 3) LIMIT 1
---
  def new
    if is_login
      @message = Message.new
      @user = User.find_by_id(session[:user_id])