app/controllers/users_controller.rb

  def edit
    if is_login
      @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 2)

  def create
    @user = User.new(params[:user])
    @user.state = 1
    @user.register_date = Time.now

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("salt", "address", "city", "comment", "identity", "created_at", "livingstate", "intro", "country", "hash_password", "register_date", "updated_at", "zipcode", "username", "rateave", "change_date", "email", "state") VALUES('21747341400.846623105613994', NULL, NULL, NULL, 't', '2010-11-16 16:16:43', NULL, NULL, NULL, '2b7b82c1d9ae1476815c9f24db8e6cf4404f015f', '2010-11-16 16:16:43', '2010-11-16 16:16:43', NULL, '777777', NULL, NULL, 'zqsharejoy@gmail.com', 't')

  def personalInfo
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 3)

  def change_password
    if is_login
      @user = User.find_by_id(session[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1